{
    "@context" : "http://schema.org",
    "@type" : "Product",
    "name" : "Renting, Selling & Niche Equipment in Arizona - BizBuySell",
    "alternateName" : "$8,800,000 in assets – 100% collateralized!","logo" : "https://images.bizbuysell.com/shared/listings/163/1637996/f33e1ffd-c0d2-4384-b40e-2ffc7ab5ef90-W768.jpg","category" : "Heavy Construction > Other","description" : "8,855,000 in assets with focus in cranes, drilling equipment and repairs! This business earned over $11.8MM in sales and $2.3MM in cash flow for 2018 with a 20% profit margin.  This company has succeeded by placing focus on construction and foundation equipment sales and building their expertise in this field.  The professional team can help contractors, subcontractors, foundation companies, or other contracting businesses purchase or rent the equipment needed for their large infrastructure and construction projects.  Over $2.6MM in inventory of machinery and parts is on-hand, but any item can be ordered from the manufacturer.  This team of six offers ancillary services including consulting on equipment choice, training for use, as well as service and maintenance for current owners or renters, while the owners oversee sales, consulting, and finances.  With inventory on-hand for sales as well as rentals, all equipment is stored on a large, 7 acre fenced property in the Southwest US.  Included on the property is a 2,400 sq. ft. building that houses five offices for the administrative staff.  The second location has five offices, a conference room, and is utilized by administrative staff only.  To build revenue further, focused could be placed on expanding the rental inventory or offering long-term leases.  New focus could be placed on generating contracting work or expanding into casing manufacturing to diversify income streams.",
    "url" : "https://www.bizbuysell.com/Business-Opportunity/Renting-Selling-and-Niche-Equipment/1637996/"
    ,"productid" : "1637996","isSimilarTo" : [{"@type":"Product","name":"Bubble Soccer in Chandler, Arizona - BizBuySell","logo":"https://images.bizbuysell.com/shared/listings/141/1412124/08ce7359-0b48-4a23-9324-4f6ee96e9473-W768.jpg","url":"https://www.bizbuysell.com/Business-Opportunity/Bubble-Soccer/1412124/","productid":"1412124","offers":{"@type":"Offer","price":5000.00,"priceCurrency":"USD","availableAtOrFrom":{"@type":"Place","address":{"@type":"PostalAddress","addressLocality":"Chandler","addressRegion":"Arizona","streetAddress":"4414 E Runaway Bay Dr"}}}},{"@type":"Product","name":"CPA Firm for Sale After 4/15/18 in Scottsdale, Arizona - BizBuySell","logo":"https://images.bizbuysell.com/shared/listings/148/1482293/b4f4bb11-8e22-447c-b529-f5b347769807-W768.jpg","url":"https://www.bizbuysell.com/Business-Opportunity/CPA-Firm-for-Sale-After-4-15-18/1482293/","productid":"1482293","offers":{"@type":"Offer","price":487683.00,"priceCurrency":"USD","availableAtOrFrom":{"@type":"Place","address":{"@type":"PostalAddress","addressLocality":"Scottsdale","addressRegion":"Arizona"}}}},{"@type":"Product","name":"Motorcycle Parts Sales and Service in Maricopa County, Arizona - BizBuySell","logo":"https://images.bizbuysell.com/shared/listings/155/1552345/044f216f-c68e-42c3-b518-33855eeb7f86-W768.png","url":"https://www.bizbuysell.com/Business-Opportunity/Motorcycle-Parts-Sales-and-Service/1552345/","productid":"1552345","offers":{"@type":"Offer","price":400000.00,"priceCurrency":"USD","availableAtOrFrom":{"@type":"Place","address":{"@type":"PostalAddress","addressLocality":"Maricopa","addressRegion":"Arizona"}}}},{"@type":"Product","name":"1-800 Plumber","logo":"https://images.bizbuysell.com/fnw/images/2/2/c58cf628-8e02-4e61-95f9-d1c95f98800d.gif","url":"https://www.bizbuysell.com/franchise-for-sale/1-800-plumber-business-service/","offers":{"@type":"Offer","price":85000.00,"priceCurrency":"USD"}}],"offers" : {
        "@type" : "Offer",
        "price":9050000.00,"priceCurrency":"USD"
        ,"offeredBy" : {"@type":"Person","name":"Cortney Sells","description":"Always Confidential with The Firm","url":"https://www.bizbuysell.com/business-broker/cortney-sells/the-firm/9448/","jobTitle":"Business Broker","image":"https://images.bizbuysell.com/shared/brokerdirectory/images/15655/pf_prs_CortneySellsHeadshot.jpg","address":[{"@type":"PostalAddress","addressLocality":"Douglas County","addressRegion":"Nebraska"},{"@type":"PostalAddress","addressLocality":"Pottawattamie County","addressRegion":"Iowa"},{"@type":"PostalAddress","addressLocality":"Lancaster County","addressRegion":"Nebraska"},{"@type":"PostalAddress","addressLocality":"Sarpy County","addressRegion":"Nebraska"},{"@type":"PostalAddress","addressLocality":"Minnehaha County","addressRegion":"South Dakota"}],"worksFor":{"@type":"Organization","name":"The Firm","description":"Sells is an accomplished businesswoman with expertise and instinct for mergers and acquisitions. With over 150 transactions under her belt since 2010, she and her team at The Firm specialize in pairing the owners of existing businesses with qualified individuals who can continue the legacy of the business. In 2018 alone they brought 49 businesses to the closing table, which is a nationally recognized high.Sells leads a team of empowered professionals who share her passion for client services and helping buyers and sellers imagine their futures, whether that means retirement, change in industry, or simply acquiring a company to expand their personal wealth. The Firm Business Brokerage works with businesses large and small, from the Middle Market to Main Street. If you’d like to pursue an exit from an existing company or would like to become a business owner without “starting from scratch”, Sells and her team would welcome the opportunity to meet with you.Prior to founding The Firm, Sells founded Agency 89, a talent agency which then became Nebraska’s first licensed talent school. She served as President until the agency’s acquisition in 2009.Among her professional affiliations are Vistage, a board member of Entrepreneur’s Organization Nebraska (EO), Rotary International and the Greater Omaha Chamber of Commerce. She served on the board of Heartland Family Services and volunteers regularly for organizations such as The Leukemia & Lymphoma Society, where she was a nominee for Woman of the Year, St. Patrick’s parish and is a mentor for the Transition Assistance Program at Offutt Air Force Base.Sells was named “Best of Omaha” Business Broker of the Year from 2012-20178 She is also the Editor of The Deal Review, a publication distributed to 21,000 business owners. Her accomplishments include cover stories in Midlands Business Journal, The Daily Record, Omaha Magazine, and features on Fox News and CBS’ Morning Blend.When away from the office, Cortney and her partner Adam enjoy active roles at St. Margaret Mary Catholic School, coaching their daughter Vienna’s soccer team and boating on the lake with their son Knoxx and three dogs.","logo":"https://images.bizbuysell.com/shared/brokerdirectory/images/15655/lg_cmp_Logo.jpg"}}
    }
}